9/data/attachments/15026476a4ba6ce6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b9e16bab-8608-4bc4-8d04-c9a69ef54cc2</nif:username>
            <nif:friendToBeAdded>Lance_public_Friend_4686_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>